{"name":"Sam Lerdahl","headerTaglineOne":"Hello 👋","headerTaglineTwo":"I'm Sam Lerdahl - a creative","headerTaglineThree":"Product Visionary based","headerTaglineFour":"in Minneapolis, MN.","showCursor":true,"showBlog":true,"darkMode":true,"showResume":true,"socials":[{"id":"1","title":"Github","link":"https://github.com/samldahl"},{"id":"2","title":"LinkedIn","link":"https://www.linkedin.com/in/samlerdahl/"},{"id":"3","title":"Twitter","link":"https://x.com/samldahl"},{"id":"4","title":"Medium","link":"https://medium.com/@slerdahl"},{"id":"5","title":"Email","link":"mailto:swlerdahl@gmail.com"}],"projects":[{"id":"1","title":"The Necessity of Data","description":"Great teams aren’t just built on talent; they are built on trust, focus, and an understanding of how to navigate challenges. Building team culture isn’t about controlling every detail—it’s about choosing battles wisely, empowering individuals, and making decisions based on data, not opinions.","imageSrc":"https://www.metabase.com/docs/latest/dashboards/images/dashboard.png","url":"https://samlerdahl.notion.site/Empowering-Data-191b7ad65ff880b29e33f334da0da2b6"},{"id":"2","title":"Designing for Developers","description":"Great UI/UX design isn’t about aesthetics—it’s about solving problems efficiently and iteratively. The key to building an intuitive and effective user experience lies in deploying low-level strategies that deeply understand user needs, identify missing elements, and iterate quickly to ensure seamless functionality.","imageSrc":"https://i.imgur.com/JinYmLM.png","url":"https://samlerdahl.notion.site/The-best-experiences-191b7ad65ff8809bb63fc26033fe97ba"},{"id":"3","title":"Managing a better roadmap","description":"In a world where budgets vary and priorities shift, not everything should be expensive. The challenge in solution development isn’t just about saying yes or no—it’s about saying yes to the right things while maintaining the flexibility to adapt as you learn more. This is where Agile development plays a critical role, allowing teams to make smart, calculated decisions that drive progress without overcommitting resources.","imageSrc":"https://i.imgur.com/YqMpetd.png","url":"https://samlerdahl.notion.site/Build-Small-Try-All-191b7ad65ff88027ab18c91e8017beb8"},{"id":"4","title":"Overbuilding hurts progress","description":"Saying no is one of the most undervalued and overlooked skills in business and life. It’s easy to believe that more is better, that adding just one more great idea will lead to success. But in reality, focus—the ability to say no—is what creates momentum, trust, and real progress.","imageSrc":"https://i.imgur.com/USB5C8O.jpeg","url":"https://samlerdahl.notion.site/The-Power-of-No-191b7ad65ff88066a4daef5b83b010b4"},{"id":"5","title":"Viral GrassRoots Growth","description":"In a world dominated by digital marketing and automated outreach, there’s something refreshingly powerful about getting back to the basics—connecting with people face-to-face and fostering real relationships. At the heart of our growth strategy lies a grassroots effort that prioritizes relationship depth, community involvement, and authentic engagement. I’m not afraid to get our hands dirty to create meaningful connections and build a strong foundation for long-term success.","imageSrc":"https://i.imgur.com/BKBYMjZ.png","url":"https://samlerdahl.notion.site/Viral-GrassRoot-Growth-191b7ad65ff88036b16fc336365ebf3f"},{"id":"6","title":"Avoid Buying Customers","description":"In the competitive world of marketing, it’s easy to fall into the trap of discounts and cash incentives. I’ve ran plenty of deal based ads that serve the purpose of risk mitigation. But here’s the truth: anyone can offer a discount. Anyone can give away dollars. What truly makes a brand stand out is the value it provides beyond the transaction. Customers don’t just need an initial reason to try your product or service—they need a compelling reason to stay and pay.","imageSrc":"https://i.imgur.com/XUZx7qk.jpeg","url":"https://samlerdahl.notion.site/Avoid-paying-for-business-191b7ad65ff88053af2ce292c1848313"},{"id":"2702aec5-63a3-44a2-b699-4cf48c682603","title":"Being a leader everywhere","description":"Managing a team of 50+ engineers isn’t just about delivering a competitive product—it’s about conducting a symphony of individual contributions, responsibilities, and motivations. At its core, leadership in engineering is about pairing grace with responsibility, accountability, and authority while fostering a culture where people love to show up and do their best work.","imageSrc":"https://i.imgur.com/5TgwErx.jpeg","url":"https://samlerdahl.notion.site/Building-up-teammates-191b7ad65ff880c68374dc6481a5133a"}],"services":[{"id":"1","title":"Project Management","description":"I manage product roadmaps, define requirements, and lead teams to deliver successful launches. My work involves gathering insights, setting clear goals, and ensuring timely delivery while maintaining quality and efficiency."},{"id":"2","title":"Branding","description":"Creating unique, memorable, and impactful brand identities that stand out in the market. I excel at crafting messaging and visual frameworks that reflect a brand’s values and resonate with its target audience."},{"id":"3","title":"UI/UX Design","description":"Designing intuitive and user-centric interfaces that combine functionality with aesthetics. I excel at wireframing, prototyping, and creating seamless user experiences by analyzing user behaviors and prioritizing accessibility."},{"id":"4","title":"Functional Copy Writing","description":"Crafting persuasive, engaging, and actionable copy that drives results. I excel at understanding the audience’s pain points and translating product features into compelling benefits. My focus is on clarity, tone, and purpose, ensuring the message resonates and converts."}],"aboutpara":"Sam Lerdahl is an experienced product leader and entrepreneur who co-founded multiple ventures to address innovative challenges. With expertise in last-mile delivery, youth entrepreneurship, and data analytics, Sam combines strategy, leadership, and hands-on execution to deliver impactful results.","resume":{"tagline":"👋  I'm a software engineer, product designer.","description":"I have delivered world-class user experiences to millions of people. Well-versed with React, Javascript, and most of the Web frameworks.","experiences":[{"id":"1","dates":"March 2022 - Feb 2024","type":"Full Time","position":"Co-Founder, Head of Product","bullets":"Raised $9.3M from notable investors including Foundry Group; Unusual Ventures; and executives from Instacart and GoPuff, Built and lead a 55-member team across offices in Minneapolis MN and New Delhi India, Scaled delivery operations from 0 to over 4000 refrigerated store deliveries per month, Partnered with notable retailers and industry leaders to provide quality white-labeled last-mile service with custom vehicles; software; and hardware, Helped Spearheaded YoY growth— expanding to multiple U.S. markets, Enabled group buying and delivery; social savings and optimized routing, Hired and onboarded a successor to continue scaling product team post Series A"},{"id":"d495c23b-4f65-479a-9b8a-cfbc1c089725","dates":"","type":"","position":"","bullets":""}],"education":{"universityName":"University X","universityDate":"2017-paused","universityPara":"(paused education after raising venture capital and joining Techstars + Target Retail class '18)"},"languages":["Technical Leadership & Execution – Manage development teams to build, scale, and optimize complex technical stacks while ensuring alignment between engineering and business goals.","Product Strategy & Optimization – Lead product roadmaps, prioritize features, and implement process improvements to streamline workflows and enhance execution.","Cross-Functional Collaboration – Work across engineering, design, marketing, and operations to drive product development in fast-paced, resource-limited environments.","Data-Driven Growth – Leverage BI tools like Metabase, SQL, and customer insights to develop strategies that drive scalability and product improvements.","Business & Investor Relations – Work with stakeholders and investors, contributing to fundraising efforts, business strategy, and long-term vision.","Rapid Prototyping & Iteration – Use tools like Figma, Sketch, and Adobe XD to build and test design concepts quickly.","Design System & Consistency – Develop and maintain scalable design systems to ensure consistency across all products and platforms."],"frameworks":[],"others":[]}}